       01 ENREG-CONGE.
           05 CONGE-EMP-ID     PIC 9(5).
           05 CONGE-TYPE       PIC X(10).
           05 CONGE-DEBUT      PIC X(10).
           05 CONGE-FIN        PIC X(10).
           05 CONGE-NB-JOURS   PIC 9(3).