       01 ENREG-EMPLOYE.
           05 EMP-ID       PIC 9(5).
           05 EMP-NOM      PIC X(20).
           05 EMP-PRENOM   PIC X(20).
           05 EMP-SALAIRE  PIC 9(5)V9(2).
           05 EMP-CATEGORIE PIC X(10).